# data for bot
# ---------------------------------------------------------------------------- #
token_bot = '1696191613:AAHT5wn0R5Gjr__Kd-MjmtQEnoD64oKEGrQ'

answer_first_layer = ["Зв'язатись з менеджером з приводу замовлення товару",
                      "Підписатись на акційні повідомлення",
                      "Дізнатись деталі для повернення товару",
                      "Я залишив відгук на маркетплейсі"]

id_admins = [188545439, 530420596]
# ---------------------------------------------------------------------------- #

# data for database
# ---------------------------------------------------------------------------- #
host = '127.0.0.1'
user = ''
password = ''
db_name = ''
# ---------------------------------------------------------------------------- #
