import os

from dotenv import load_dotenv

load_dotenv()

BOT_TOKEN = str(os.getenv("BOT_TOKEN"))
admins = [
    188545439
]

queue_to_communication = []
dict_to_communication = {}

ip = os.getenv("ip")

aiogram_redis = {
    'host': ip,
}

redis = {
    'address': (ip, 6379),
    'encoding': 'utf8'
}

i = []

sale_product = {
    "1": {
        "name": "Ретро подвесной светильник Loft (PM3-20018)",
        "old_price": "800",
        "new_price": "680",
        "charact": f"Бренд: Aurosens\nПризначення: Освещение\nСклад: метал | текстиль\n"
                   f"Стиль: Лофт | Ретро | Хай Тек |Модерн\nТип: Люстра\nТип цоколю: Е27\nКолір: белый-золотой",
        "about": f"Потолочный светильник в стиле ретро Aurosens Металлическая основа соединяет в себе простую "
                 f"форму и современный дизайн. Идеально подходит для интерьеров, оформленных в скандинавском стиле, "
                 f"лофте и модерне. \nВысота: 23,5 см\nДиаметр: 28 см\nДлина кабеля: 60 см\nСпасибо, что выбрали нас!",
        "img": f"{os.getcwd()}/img/PM3-20018.jpg",
        "other_img": f"{os.getcwd()}/img/PM3-20018_1.jpg;{os.getcwd()}/img/PM3-20018_2.jpg"
    },
    "2": {
        "name": "PM1-11055, Телескопічна полиця для душа (хром)",
        "old_price": "1096",
        "new_price": "931",
        "charact": f"Бренд: miomare\nПризначення: Для душової кабіни | Під шампунь\nСклад: нержавіюча сталь | пластик\n"
                   f"Країна виробника бренду: Німеччина\nКраїна-виробник товару: Німеччина\nКолір: металік",
        "about": "Телескопічна полиця для душу хромована від miomare. Полка має 3 корзини для зберігання душового "
                 "приладдя. Легка збірка за допомогою затискної системи. Плавно регульована висота від 123"
                 " до 260 см, з шириною кошика 25,5 див. Основа з нержавіючої сталі. Кошики зі спеціальним"
                 " антикорозійним захистом, завдяки хромованому покриттю. Інструкція по застосуванню включена в"
                 " комплектації. Максимальне навантаження на кошик: 3 кг.",
        "img": f"{os.getcwd()}/img/PM1-11055.jpg",
        "other_img": f"{os.getcwd()}/img/PM1-11055_1.jpg;{os.getcwd()}/img/PM1-11055_2.jpg"
    },
    "3": {
        "name": "Підставка під вазон ( PM3-10106 )",
        "old_price": "320",
        "new_price": "272",
        "charact": f"Бренд: Home\nКількість полиць: 1 шт\nПризначення: Для вазонів\nСклад: метал\n"
                   f"Країна виробника бренду: Нідерланди\nКолір: золото | чорний\nРозміри: Ø 10\n"
                   f"Розміри стійки:16 х 10 х 10 см",
        "about": "Підставка під вазон виконана в стилі Loft прекрасно підійде для зручного розміщення невеликих"
                 " вазонів і прикрасить ваш інтер'єр. Красиво, зручно, оригінально.",
        "img": f"{os.getcwd()}/img/PM3-10106.jpg",
        "other_img": f"{os.getcwd()}/img/PM3-10106_1.jpg;{os.getcwd()}/img/PM3-10106_2.jpg"
    },
    "4": {
        "name": "Набір дзеркал 3 шт Ø12.5 см (PM3-10113)",
        "old_price": "560",
        "new_price": "476",
        "charact": f"Країна виробник: Нідерланди\nФорма: Кругла\nБренд: Home\nПризначення: Для дому\n"
                   f"Склад: метал | скло\nТип: Настінні\nКолір: золотий\nКолір рами: золотий\nШирина: 25 см\n"
                   f"Висота: 25 см",
        "about": "Набір дзеркал Home настінних прекрасно впишеться в ваш інтер'єр. Дзеркала круглої форми, на рамі "
                 "навколо дзеркала мереживне оформлення та біжутерія. Набір з 3-х дзеркал. Розміри одного дзеркала:"
                 " 25 х 25 х 1.5 см Діаметр дзеркала 12,5 см.",
        "img": f"{os.getcwd()}/img/PM3-10113.jpg",
        "other_img": f"{os.getcwd()}/img/PM3-10113_1.jpg;{os.getcwd()}/img/PM3-10113_2.jpg;"
               f"{os.getcwd()}/img/PM3-10113_3.jpg"
    },
    "5": {
        "name": "PM1-20033, Ручний блендер 3 в 1",
        "old_price": "1360",
        "new_price": "1156",
        "charact": f"Країна виробник: Німеччина\nБренд: Silver Crest\nВага: 1400 г\nЄмність склянки: 700 мл\n"
                   f"Подрібнювач: Ніж\nКількість швидкостей: 5\nКомплектація: Блендер, міксер, чаша, склянка\n"
                   f"Потужність: 600 Вт\nСклад: пластик | метал\nТип: Блендери\nКолір: бузковий-білий",
        "about": f"Ручний блендер 3 в 1 від Silver Crest\nЦей ручний блендер оснащений потужним двигуном з плавно"
                 f" регульованою швидкістю і функцією турбонаддува. Стаціонарний блендер, віночок і вставка для лез"
                 f" виготовлені з нержавіючої сталі. Подрібнювач має ємність 600 мл, а мірний стакан - 700 мл.\n"
                 f"Технічні характеристики:\n\nПотужність: Потужність 600 Вт.\nПриналежності: Включаючи подрібнювач "
                 f"(600 мл), віночок і мірний стакан (700 мл) з кришкою.\nДовжина кабелю: 150 см",
        "img": f"{os.getcwd()}/img/PM1-20033.jpg",
        "other_img": f"{os.getcwd()}/img/PM1-20033_1.jpg;{os.getcwd()}/img/PM1-20033_2.jpg;"
               f"{os.getcwd()}/img/PM1-20033_3.jpg"
    },
    "6": {
        "name": "PM1-20031, Чаші для збивання та змішування - 2 шт",
        "old_price": "480",
        "new_price": "408",
        "charact": f"Країна виробник	Німеччина\nБренд: KAISER\nВага: 1150 г\nВид: Миска для тіста\n"
                   f"Комплектація: 2 шт\nМожна мити в посудомийній машині: Так\nОб'єм: 3 л | 4,5 л\n"
                   f"Розміри	31х25,5х15,5 см | 26х22х13,5 см\nСклад: пластик\nТип: Ємність\nКолір: білий-червоний",
        "about": "Набір з 2 чаш\n• 100% меламін AUMIT, безпечний для харчових продуктів \n"
                 "• Стабільний і нековзний - нековзне кільце \n• Простота використання - ручка і зливний носик "
                 "«однією рукою» \n• Без запаху і смаку \n• Стійкість до подряпин \n• Можливість штабелювання",
        "img": f"{os.getcwd()}/img/PM1-20031.jpg",
        "other_img": f"{os.getcwd()}/img/PM1-20031_1.jpg;{os.getcwd()}/img/PM1-20031_2.jpg"
    }
}
